{"input": "So during the first phase you would have your own personal coach that we would pair you with and your coach would actually specialize in helping [PEOPLE LIKE THEM WITH THEIR PROBLEMS].... So you’re exactly the type of person we help… So with that coach you would be working with them 1:1 so that you can create a lifestyle that would allow you to [GOAL] but far more importantly... to teach you to actually maintain that long term.", "output": "So that initial phase lasts an absolute minimum of X Months But we would work with you until you have achieved the goal weight you set with your coach when you start.", "persona": "Script_Persona_pitch_phase", "context": {"buying_stage": "most_aware", "communication_style": "skeptical", "sales_stage": "presentation", "intent": "question", "emotion": "neutral"}}
{"input": "So we need to give you a really simple, really easy, really clear plan that you CAN ACTUALLY  follow that's going to get you to your goal.", "output": "No questions asked. Does that make sense", "persona": "Script_Persona_pitch_phase", "context": {"buying_stage": "most_aware", "communication_style": "skeptical", "sales_stage": "presentation", "intent": "statement", "emotion": "neutral"}}
{"input": "Jumped Straight in… They were burned before. And they want to use a Different Process to make Decisions now. Add Extra Time…", "output": "I made decisions quickly in the past… and it didn’t work out for me..  This Time I want to take 24 hours", "persona": "Hesitant_Decision_Maker", "context": {"buying_stage": "product_aware", "communication_style": "analytical", "sales_stage": "opening", "intent": "closing", "emotion": "neutral"}}
{"input": "But Again book the call is only step 1, you can buy a gym membership but if you don't get under the bar you;e not going to get any muscle Right? The Question is do you actually want to get your business to 20 month or do you want to be one of those people that is always jumping on calls , watching podcasts... always watching motivational videos... but isn't actually putting in the Work and making the hard decisions of where they want to be? Cant Imagine you want to be one of those, right?", "output": "Why not though? Cause you could", "persona": "Hesitant_Decision_Maker", "context": {"buying_stage": "product_aware", "communication_style": "analytical", "sales_stage": "discovery", "intent": "question", "emotion": "neutral"}}
{"input": "you can give me a yes in 2026 if you want , the questions is how much longer do you wnat 5k to be a worry for you?", "output": "It's not really a worry, it's just that the reality of the situatino\tWhat is the reality of the situation\tI dont't have a Million bucks", "persona": "Hesitant_Decision_Maker", "context": {"buying_stage": "product_aware", "communication_style": "analytical", "sales_stage": "discovery", "intent": "question", "emotion": "neutral"}}
{"input": "# ROLEPLAY TRANSCRIPT", "output": "- 'SCRIPT GRAIL.docx' is a main full script\n- sales-training-transcripts contains small talk, question answering and sometimes short specific section roleplays", "persona": "Generic_Prospect", "context": {"buying_stage": "problem_aware", "communication_style": "casual", "sales_stage": "discovery", "intent": "statement", "emotion": "neutral"}}
